app/views/messages/new.html.erb

SELECT "users".* FROM "users"
---
  <select name="recipient">
      <% @all.users.each do |user| %>