app/controllers/messages_controller.rb

  def index
    if !session[:user_id]
      redirect_to "/sessions"
    end
    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def outbox
    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    if !session[:user_id]
      redirect_to "/sessions"
    end
    @all_users = User.all
---
SELECT "users".* FROM "users"

  def create
    message = Message.new(content: params[:message])
    message.save
    sender = User.find(session[:user_id])
    recipient = User.find(params[:recipient])
    Contact.create(sender: sender, recipient: recipient, message: message)
---
INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "hey"], ["created_at", 2017-03-20 20:17:27 UTC], ["updated_at", 2017-03-20 20:17:27 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "contacts" ("sender_id", "recipient_id", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sender_id", 1], ["recipient_id", 3], ["message_id", 5], ["created_at", 2017-03-20 20:19:06 UTC], ["updated_at", 2017-03-20 20:19:06 UTC]]