app/controllers/sessions_controller.rb

  def create
    user = User.find_by_name(params[:name])
    if user
      puts "found a user!"
      session[:user_id] = user.id
      session[:name] = user.name
    else
      puts "creating a user!"
      user = User.new(name: params[:name])
      user.save
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Mike"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "cwulfsohn"], ["created_at", 2017-03-20 19:46:18 UTC], ["updated_at", 2017-03-20 19:46:18 UTC]]